MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MC504/mcu.h
#define _C1CFG2_PRSEG0_POSITION                  0x00000000
#define _C1CFG2_PRSEG0_MASK                      0x00000001
#define _C1CFG2_PRSEG0_LENGTH                    0x00000001

#define _C1CFG2_PRSEG1_POSITION                  0x00000001
#define _C1CFG2_PRSEG1_MASK                      0x00000002
#define _C1CFG2_PRSEG1_LENGTH                    0x00000001

#define _C1CFG2_PRSEG2_POSITION                  0x00000002
#define _C1CFG2_PRSEG2_MASK                      0x00000004
#define _C1CFG2_PRSEG2_LENGTH                    0x00000001

#define _C1CFG2_SEG1PH0_POSITION                 0x00000003
#define _C1CFG2_SEG1PH0_MASK                     0x00000008
#define _C1CFG2_SEG1PH0_LENGTH                   0x00000001

#define _C1CFG2_SEG1PH1_POSITION                 0x00000004
#define _C1CFG2_SEG1PH1_MASK                     0x00000010
#define _C1CFG2_SEG1PH1_LENGTH                   0x00000001

#define _C1CFG2_SEG1PH2_POSITION                 0x00000005
#define _C1CFG2_SEG1PH2_MASK                     0x00000020
#define _C1CFG2_SEG1PH2_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH0_POSITION                 0x00000008
#define _C1CFG2_SEG2PH0_MASK                     0x00000100
#define _C1CFG2_SEG2PH0_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH1_POSITION                 0x00000009
#define _C1CFG2_SEG2PH1_MASK                     0x00000200
#define _C1CFG2_SEG2PH1_LENGTH                   0x00000001

#define _C1CFG2_SEG2PH2_POSITION                 0x0000000A
#define _C1CFG2_SEG2PH2_MASK                     0x00000400
#define _C1CFG2_SEG2PH2_LENGTH                   0x00000001

#define _C1FEN1_FLTEN0_POSITION                  0x00000000
#define _C1FEN1_FLTEN0_MASK                      0x00000001
#define _C1FEN1_FLTEN0_LENGTH                    0x00000001

#define _C1FEN1_FLTEN1_POSITION                  0x00000001
#define _C1FEN1_FLTEN1_MASK                      0x00000002
#define _C1FEN1_FLTEN1_LENGTH                    0x00000001

#define _C1FEN1_FLTEN2_POSITION                  0x00000002
#define _C1FEN1_FLTEN2_MASK                      0x00000004
#define _C1FEN1_FLTEN2_LENGTH                    0x00000001

#define _C1FEN1_FLTEN3_POSITION                  0x00000003
#define _C1FEN1_FLTEN3_MASK                      0x00000008
#define _C1FEN1_FLTEN3_LENGTH                    0x00000001

#define _C1FEN1_FLTEN4_POSITION                  0x00000004
#define _C1FEN1_FLTEN4_MASK                      0x00000010
#define _C1FEN1_FLTEN4_LENGTH                    0x00000001

#define _C1FEN1_FLTEN5_POSITION                  0x00000005
#define _C1FEN1_FLTEN5_MASK                      0x00000020
#define _C1FEN1_FLTEN5_LENGTH                    0x00000001

#define _C1FEN1_FLTEN6_POSITION                  0x00000006
#define _C1FEN1_FLTEN6_MASK                      0x00000040
#define _C1FEN1_FLTEN6_LENGTH                    0x00000001

#define _C1FEN1_FLTEN7_POSITION                  0x00000007
#define _C1FEN1_FLTEN7_MASK                      0x00000080
#define _C1FEN1_FLTEN7_LENGTH                    0x00000001

#define _C1FEN1_FLTEN8_POSITION                  0x00000008
#define _C1FEN1_FLTEN8_MASK                      0x00000100
#define _C1FEN1_FLTEN8_LENGTH                    0x00000001

#define _C1FEN1_FLTEN9_POSITION                  0x00000009
#define _C1FEN1_FLTEN9_MASK                      0x00000200
#define _C1FEN1_FLTEN9_LENGTH                    0x00000001

#define _C1FEN1_FLTEN10_POSITION                 0x0000000A
#define _C1FEN1_FLTEN10_MASK                     0x00000400
#define _C1FEN1_FLTEN10_LENGTH                   0x00000001

#define _C1FEN1_FLTEN11_POSITION                 0x0000000B
#define _C1FEN1_FLTEN11_MASK                     0x00000800
#define _C1FEN1_FLTEN11_LENGTH                   0x00000001

#define _C1FEN1_FLTEN12_POSITION                 0x0000000C
#define _C1FEN1_FLTEN12_MASK                     0x00001000
#define _C1FEN1_FLTEN12_LENGTH                   0x00000001

#define _C1FEN1_FLTEN13_POSITION                 0x0000000D
#define _C1FEN1_FLTEN13_MASK                     0x00002000
#define _C1FEN1_FLTEN13_LENGTH                   0x00000001

#define _C1FEN1_FLTEN14_POSITION                 0x0000000E
#define _C1FEN1_FLTEN14_MASK                     0x00004000
#define _C1FEN1_FLTEN14_LENGTH                   0x00000001

#define _C1FEN1_FLTEN15_POSITION                 0x0000000F
#define _C1FEN1_FLTEN15_MASK                     0x00008000
#define _C1FEN1_FLTEN15_LENGTH                   0x00000001

#define _C1FMSKSEL1_F0MSK_POSITION               0x00000000
#define _C1FMSKSEL1_F0MSK_MASK                   0x00000003
#define _C1FMSKSEL1_F0MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F1MSK_POSITION               0x00000002
#define _C1FMSKSEL1_F1MSK_MASK                   0x0000000C
#define _C1FMSKSEL1_F1MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F2MSK_POSITION               0x00000004
#define _C1FMSKSEL1_F2MSK_MASK                   0x00000030
#define _C1FMSKSEL1_F2MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F3MSK_POSITION               0x00000006
#define _C1FMSKSEL1_F3MSK_MASK                   0x000000C0
#define _C1FMSKSEL1_F3MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F4MSK_POSITION               0x00000008
#define _C1FMSKSEL1_F4MSK_MASK                   0x00000300
#define _C1FMSKSEL1_F4MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F5MSK_POSITION               0x0000000A
#define _C1FMSKSEL1_F5MSK_MASK                   0x00000C00
#define _C1FMSKSEL1_F5MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F6MSK_POSITION               0x0000000C
#define _C1FMSKSEL1_F6MSK_MASK                   0x00003000
#define _C1FMSKSEL1_F6MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F7MSK_POSITION               0x0000000E
#define _C1FMSKSEL1_F7MSK_MASK                   0x0000C000
#define _C1FMSKSEL1_F7MSK_LENGTH                 0x00000002

#define _C1FMSKSEL1_F0MSK0_POSITION              0x00000000
#define _C1FMSKSEL1_F0MSK0_MASK                  0x00000001
#define _C1FMSKSEL1_F0MSK0_LENGTH                0x00000001

#define _C1FMSKSEL1_F0MSK1_POSITION              0x00000001
#define _C1FMSKSEL1_F0MSK1_MASK                  0x00000002
#define _C1FMSKSEL1_F0MSK1_LENGTH                0x00000001

