MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP256MC504/mcu.h
#define _RPOR5_RP54R5_POSITION                   0x00000005
#define _RPOR5_RP54R5_MASK                       0x00000020
#define _RPOR5_RP54R5_LENGTH                     0x00000001

#define _RPOR5_RP55R0_POSITION                   0x00000008
#define _RPOR5_RP55R0_MASK                       0x00000100
#define _RPOR5_RP55R0_LENGTH                     0x00000001

#define _RPOR5_RP55R1_POSITION                   0x00000009
#define _RPOR5_RP55R1_MASK                       0x00000200
#define _RPOR5_RP55R1_LENGTH                     0x00000001

#define _RPOR5_RP55R2_POSITION                   0x0000000A
#define _RPOR5_RP55R2_MASK                       0x00000400
#define _RPOR5_RP55R2_LENGTH                     0x00000001

#define _RPOR5_RP55R3_POSITION                   0x0000000B
#define _RPOR5_RP55R3_MASK                       0x00000800
#define _RPOR5_RP55R3_LENGTH                     0x00000001

#define _RPOR5_RP55R4_POSITION                   0x0000000C
#define _RPOR5_RP55R4_MASK                       0x00001000
#define _RPOR5_RP55R4_LENGTH                     0x00000001

#define _RPOR5_RP55R5_POSITION                   0x0000000D
#define _RPOR5_RP55R5_MASK                       0x00002000
#define _RPOR5_RP55R5_LENGTH                     0x00000001

#define _RPOR6_RP56R_POSITION                    0x00000000
#define _RPOR6_RP56R_MASK                        0x0000003F
#define _RPOR6_RP56R_LENGTH                      0x00000006

#define _RPOR6_RP57R_POSITION                    0x00000008
#define _RPOR6_RP57R_MASK                        0x00003F00
#define _RPOR6_RP57R_LENGTH                      0x00000006

#define _RPOR6_RP56R0_POSITION                   0x00000000
#define _RPOR6_RP56R0_MASK                       0x00000001
#define _RPOR6_RP56R0_LENGTH                     0x00000001

#define _RPOR6_RP56R1_POSITION                   0x00000001
#define _RPOR6_RP56R1_MASK                       0x00000002
#define _RPOR6_RP56R1_LENGTH                     0x00000001

#define _RPOR6_RP56R2_POSITION                   0x00000002
#define _RPOR6_RP56R2_MASK                       0x00000004
#define _RPOR6_RP56R2_LENGTH                     0x00000001

#define _RPOR6_RP56R3_POSITION                   0x00000003
#define _RPOR6_RP56R3_MASK                       0x00000008
#define _RPOR6_RP56R3_LENGTH                     0x00000001

#define _RPOR6_RP56R4_POSITION                   0x00000004
#define _RPOR6_RP56R4_MASK                       0x00000010
#define _RPOR6_RP56R4_LENGTH                     0x00000001

#define _RPOR6_RP56R5_POSITION                   0x00000005
#define _RPOR6_RP56R5_MASK                       0x00000020
#define _RPOR6_RP56R5_LENGTH                     0x00000001

#define _RPOR6_RP57R0_POSITION                   0x00000008
#define _RPOR6_RP57R0_MASK                       0x00000100
#define _RPOR6_RP57R0_LENGTH                     0x00000001

#define _RPOR6_RP57R1_POSITION                   0x00000009
#define _RPOR6_RP57R1_MASK                       0x00000200
#define _RPOR6_RP57R1_LENGTH                     0x00000001

#define _RPOR6_RP57R2_POSITION                   0x0000000A
#define _RPOR6_RP57R2_MASK                       0x00000400
#define _RPOR6_RP57R2_LENGTH                     0x00000001

#define _RPOR6_RP57R3_POSITION                   0x0000000B
#define _RPOR6_RP57R3_MASK                       0x00000800
#define _RPOR6_RP57R3_LENGTH                     0x00000001

#define _RPOR6_RP57R4_POSITION                   0x0000000C
#define _RPOR6_RP57R4_MASK                       0x00001000
#define _RPOR6_RP57R4_LENGTH                     0x00000001

#define _RPOR6_RP57R5_POSITION                   0x0000000D
#define _RPOR6_RP57R5_MASK                       0x00002000
#define _RPOR6_RP57R5_LENGTH                     0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00007F00
#define _RPINR0_INT1R_LENGTH                     0x00000007

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR0_INT1R6_POSITION                  0x0000000E
#define _RPINR0_INT1R6_MASK                      0x00004000
#define _RPINR0_INT1R6_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000007F
#define _RPINR1_INT2R_LENGTH                     0x00000007

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

